TexasInstruments/am13x-hsp/examples/default.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM13E230x" --part "AM13E230x" --package "LQFP64_G" --product "AM13E2X SDK@26.00.00"
 * @v2CliArgs --device "AM13E23019" --package "LQFP64_G" --product "AM13E2X SDK@26.00.00"
 * @versions {"tool":"1.27.0+4565"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpio   = scripting.addModule("/drivers/gpio");
const gpio1  = gpio.addInstance();
const sysctl = scripting.addModule("/drivers/sysctl");

/**
 * Write custom configuration values to the imported modules.
 */
gpio1.$name                   = "GPIO_GRP_0";
gpio1.associatedPins[0].$name = "PIN_0";

sysctl.SYSPLLSource = "DL_SYSCTL_SYSPLL_REF_HFCLK";
sysctl.useHFCLK     = true;
sysctl.VREFSource   = "DL_SYSCTL_VREF_INTERNAL_3_3_V";
sysctl.SYSPLL_Qdiv  = 32;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio1.associatedPins[0].pin.$suggestSolution = "PB13";
sysctl.peripheral.$suggestSolution           = "SYSCTL";
sysctl.peripheral.x1Pin.$suggestSolution     = "PC16_X1";
sysctl.peripheral.x2Pin.$suggestSolution     = "PC17_X2";
